import random
while True:
    a=input("請輸入想要選號的彩券種類代碼(1.威力彩、2.大樂透、3.今彩539、4.雙贏彩、5.BINGO BINGO賓果賓果、6.3星彩、7.4星彩、8.38樂合彩、9.49樂合彩、10.39樂合彩)或是輸入no結束選號機：")
    while a!="no"and a!="1"and a!="2"and a!="3"and a!="4"and a!="5"and a!="6"and a!="7"and a!="8"and a!="9"and a!="10":
        a=input("請重新輸入想要選號的彩券種類代碼(1.威力彩、2.大樂透、3.今彩539、4.雙贏彩、5.BINGO BINGO賓果賓果、6.3星彩、7.4星彩、8.38樂合彩、9.49樂合彩、10.39樂合彩)或是輸入no結束選號機：")
    if a=="no":
        break
    elif a=="1":
        a=["1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38"]
        b=["1","2","3","4","5","6","7","8"]
        for aaa in range(32):
            aa=random.choice(a)
            a.remove(aa)
        for bbb in range(7):
            bb=random.choice(b)
            b.remove(bb)
        print("第一區：",a)
        print("第二區：",b)
    elif a=="2":
        a=["1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38","39","40","41","42","43","44","45","46","47","48","49"]
        for aaa in range(43):
            aa=random.choice(a)
            a.remove(aa)
        print("號碼：",a)
    elif a=="3":
        a=["1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38","39"]
        for aaa in range(34):
            aa=random.choice(a)
            a.remove(aa)
        print("號碼：",a)
    elif a=="4":
        a=["1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24"]
        for aaa in range(12):
            aa=random.choice(a)
            a.remove(aa)
        print("號碼：",a)
    elif a=="5":
        e=input("請輸入要選幾個號碼(1-10)：")
        while a!="1"and a!="2"and a!="3"and a!="4"and a!="5"and a!="6"and a!="7"and a!="8"and a!="9"and a!="10":
            a=input("請重新輸入要選幾個號碼(1-10)：")
        a=["1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38","39","40","41","42","43","44","45","46","47","48","49","50","51","52","53","54","55","56","57","58","59","60","61","62","63","64","65","66","67","68","69","70","71","72","73","74","75","76","77","78","79","80"]
        b=["大","小"]
        c=["單","小單","雙","小雙","和"]
        for aaa in range(80-e):
            aa=random.choice(a)
            a.remove(aa)
        bb=random.choice(b)
        b.remove(bb)
        for ccc in range(4):
            cc=random.choice(c)
            c.remove(cc)
        print("號碼：",a)
        print("猜大小：",b)
        print("猜單雙：",c)
    elif a=="6":
        a=["0","1","2","3","4","5","6","7","8","9"]
        b=["0","1","2","3","4","5","6","7","8","9"]
        c=["0","1","2","3","4","5","6","7","8","9"]
        for aaa in range(9):
            aa=random.choice(a)
            a.remove(aa)
        for bbb in range(9):
            bb=random.choice(b)
            b.remove(bb)
        for ccc in range(9):
            cc=random.choice(c)
            c.remove(cc)
        print(a+b+c)
    elif a=="7":
        a=["0","1","2","3","4","5","6","7","8","9"]
        b=["0","1","2","3","4","5","6","7","8","9"]
        c=["0","1","2","3","4","5","6","7","8","9"]
        d=["0","1","2","3","4","5","6","7","8","9"]
        for aaa in range(9):
            aa=random.choice(a)
            a.remove(aa)
        for bbb in range(9):
            bb=random.choice(b)
            b.remove(bb)
        for ccc in range(9):
            cc=random.choice(c)
            c.remove(cc)
        for ddd in range(9):
            dd=random.choice(d)
            d.remove(dd)
        print(a+b+c+d)
    elif a=="8":
        a=["1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38"]
        e=input("請輸入要選幾個號碼(2-5)：")
        while a!="2"and a!="3"and a!="4"and a!="5":
            e=input("請重新輸入要選幾個號碼(2-5)：")
        for aaa in range(38-e):
            aa=random.choice(a)
            a.remove(aa)
        print("號碼：",a)
    elif a=="9":
        a=["1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38","39","40","41","42","43","44","45","46","47","48","49"]
        e=input("請輸入要選幾個號碼(2-4)：")
        while a!="2"and a!="3"and a!="4":
            e=input("請重新輸入要選幾個號碼(2-4)：")
        for aaa in range(49-e):
            aa=random.choice(a)
            a.remove(aa)
        print("號碼：",a)
    elif a=="10":
        a=["1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38","39"]
        e=input("請輸入要選幾個號碼(2-4)：")
        while a!="2"and a!="3"and a!="4":
            e=input("請重新輸入要選幾個號碼(2-4)：")
        for aaa in range(39-e):
            aa=random.choice(a)
            a.remove(aa)
        print("號碼：",a)